Strömungssimulation/cylinderRe1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{
    p
    {
        solver          GAMG;
        smoother        DIC;

        tolerance       1e-6;
        relTol          0.1;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "U.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;

        tolerance       1e-5;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors    1;
    nCorrectors         2;
    nNonOrthogonalCorrectors 1;
    relaxationFactors
    {
	    fields
	    {
		    p	0.3;
		    pFinal	0;
	    }
	    equations
	    {
		    "(U|k|omega)"	0.7;
		    "(U|k|omega)Final"	1;
	    }
    }
    outerCorrectorResidualControl
    {
	    p
	    {
		    relTol	0;
		    tolerance	1e-2;
	    }
	    "(U|k|omega)"
	    {
		    relTol	0;
		    tolerance	1e-3;
	    }
    }
    pRefCell  0;
    pRefValue 0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
